package org.example;

import org.jsoup.nodes.Document;

/**
 * Интерфейс, който дефинира стратегия за обхождане на уебсайтове.
 * Този интерфейс позволява на различни имплементации да дефинират начините за събиране на данни от уебсайтовете
 * в зависимост от различните нужди на приложението.
 */
public interface CrawlerStrategy {

    /**
     * Метод за обхождане на уебсайт и събиране на данни.
     *
     * @param repository Хранилище за съхранение на извлечените данни.
     * @param website Адрес на уебсайта, който ще бъде обходен.
     * @param doc Документ, който представлява съдържанието на уебсайта.
     */
    void craw(JobRepository repository, String website, Document doc);
}
