package org.example;

import java.util.List;

/**
 * Интерфейс, който дефинира методи за съхранение и извличане на обяви за работа.
 * Този интерфейс трябва да бъде имплементиран от класове, които осигуряват механизъм за съхранение на обяви.
 */
public interface JobRepository {

    /**
     * Записва обява за работа в хранилището.
     *
     * @param job Обявата, която трябва да бъде записана.
     */
    void save(JobListing job);

    /**
     * Връща всички записани обяви за работа.
     *
     * @return Списък с всички обяви за работа.
     */
    List<JobListing> findAll();
}
